# for i in "Strit":
#     # print(i, end="")
#     print(1, end="")

# 1.Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).

# n = int(input("Введіть число: "))
# for i in range(n): # виконує дію print n разів
#     print("Hello, Python!")

#-----------------------------------------------------------------------------------
# 2. Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.
# a = 2
# b = 10
# c = range(a, b+1)
# for i in c:
#     print(i)


#-----------------------------------------------------------------------------------
# 3. Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.
# n = int(input("Введіть число: "))
# for i in range(n, -1, -1):
#     print(i)
# else:
#     print("Start")


# Вхідні дані:

# 5
# Вихідні дані:

# 5
# 4
# 3
# 2
# 1
# Start!

#-----------------------------------------------------------------------------------
# 4. Користувач вводить кількість навчальних предметів n, а потім, відповідно, оцінки учня з n навчальних предметів. Визначте середню оцінку.

# fach = int(input("Введіть кількість предметів: "))
# note = input("Введіть відповідні оцінки: ")
# my_list = note.split()
# my_note = list(map(int, my_list))
# print(my_note, type(my_note))
# print((sum(my_note)/fach))


# 5. Надрукувати у рядку m разів число n. Числа m і n - цілі числа, які вводить користувач у порядку n, m.

# Вхідні дані:

# 10
# 5
# Вихідні дані:

# 10 10 10 10 10

# n = 10
# m = 5
# for i in range(m):
#     print(n, end=" ")

#-----------------------------------------------------------------------------------
# 6. Напишіть програму для друку цілих чисел від n до 0 із виведенням біля кожного числа кількості символів #, що дорівнює значенню числа.

# Вхідні дані:

# 6
# Вихідні дані:

# 6 ######
# 5 #####
# 4 ####
# 3 ###
# 2 ##
# 1 #
# n = int(input("Введіть число: "))
# for i in range(n, -1, -1):
#     print(i, "#" * i)
#     if i ==1:
#         break

#-----------------------------------------------------------------------------------
# 7. Напишіть програму для побудови шаблону як у вихідних даних за введеним значенням n.

# Вхідні дані:

# 9
# Вихідні дані:

# 1
# 22
# 333
# 4444
# 55555
# 666666
# 7777777
# 88888888
# 999999999
# n = int(input("Введіть число: "))
# for i in range(n):
#     print("#", str(i+1) * (i + 1), )

# Middle level

#-----------------------------------------------------------------------------------
# 8. Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки #, коли на вхід програми подається ціле число n - кількість сходинок.

# Вхідні дані:

# 4
# Вихідні дані:

# #
# ##
# ###
# ####
# n = int(input("Введіть число: "))
# for i in range(n):
#     print("#"* (i + 1))
#-----------------------------------------------------------------------------------
# 9. За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.

# Факторіал: n! = 1 * 2 * 3 * ... * (n-1) * n
# n = 5
# factorial = 1
# if n == 0:
#     print(1)
# elif n < 0:
#     print("Не існує")
# else: 
#     for i in range(1, n +1):
#         factorial = factorial * i
#     print(factorial)

# #-----------------------------------------------------------------------------------
# 10. Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний пробіг автомобіля за всі дні перевищить t км і яке значення сумарного пробігу? Введення даних користувачем відбувається в порядку: d, t.

# Вхідні дані:

# 10
# 200
# Вихідні дані:

# 213.84 km, 12 days


# t = float(input("Введіть загальну відстань: "))   
# d = float(input("Введіть відстань за перший день: "))  
# n = 1 # рахуємо кількість ітерацій, кількість днів
# while d < t:
#     d *= 1.1
#     n += 1
# print(f"Сумарний пробіг автомобіля склав {d:.2f} кільмотрів, гонщик досяг зазначеної відстані за {n} днів")

 
# -----------------------------------------------------------------------------------
# 11. Дано ціле число n. З чисел 1, 4, 9, 16, 25, …​ надрукувати ті, які не перевищують n. (зверніть увагу на задану послідовність)
# n = 18
# number = [1, 4, 9, 16, 25]
# my_number = list(number)
# for i in number:
#     if i <= n:
#         print(i)


#-----------------------------------------------------------------------------------
# 12 Дано цілі числа a і b. Обчислити a ^ b (a в степені b), не використовуючи операцію піднесення до степеня.

# result = 1
# a = 3
# b = 5
# for i in range(b):
#     result = result * a
#     print(result)

# Hard level

# -----------------------------------------------------------------------------------
# 13. Дано натуральне число n. Визначити, чи є воно автоморфним числом.
# Примітка: Автоморфне число - число, квадрат якого рівний останнім розрядами квадрата цього числа: 5 - 25, 6 - 36, 25 - 625.

# Вхідні дані:

# 9376
# 26
# Вихідні дані:

# True
# False

#-----------------------------------------------------------------------------------
# 13. Дано натуральне число n. Надрукуйте всі n-значні непарні натуральні числа в порядку спадання.

# Вхідні дані:

# 1
# 2
# Вихідні дані:

# 9 7 5 3 1
# 99 97 95 93 91 89 87 85 83 81 79 77 75 73 71 69 67 65 63 61 59 57 55 53 51 49 47 45 43 41 39 37 35 33 31 29 27 25 23 21 19 17 15 13 11

# n = 1
# for i in range((10 ** n - 1), (10 ** (n-1)) -1, -1):
#     print(i)
           



#-----------------------------------------------------------------------------------
# 15. Написати програму для обчислення суми цифр цілого числа n. Програма має враховувати, що на вхід може подаватися ціле від’ємне число.


#-----------------------------------------------------------------------------------
# 16 Напишіть програму для отримання рядка Фібоначчі від 0 до n, де n - ціле число.
# Послідовність Фібоначчі - це серія чисел 0, 1, 1, 2, 3, 5, 8, 13, 21, .... Кожне наступне число знайдено шляхом додавання двох номерів перед ним.

# Вхідні дані:

# 50
# Вихідні дані:

# 0 1 1 2 3 5 8 13 21 34

#-----------------------------------------------------------------------------------
# 17 За введеним користувачем цілим числом n визначте n-е число Фібоначчі.

# Вхідні дані:

# 9
# 3
# 5
# Вихідні дані:

# 34
# 2
# 5