# 12. Напишіть програму для друку чисел, у яких розділювачами груп розрядів (групи по три цифри) є коми.

# enter_number = int(input("Enter number: "))
# format_number = format(enter_number, ",")
# print(int(format_number))
# print(type(format_number))

# 13. Напишіть програму, яка отримує значення радіуса кола (дробове число) від користувача та обчислює площу круга і довжину колу. Виведення результату відбувається з трьома символами після десяткової крапки. Значення числа Пі округлити до сотих.
# r = float(input("Enter number: "))
# s = 3.141592653589793 * r ** 2
# l = 2 * 3.141592653589793 * r
# print(f"Площа кругу становить {s:.3f}. Довжина кола становить {l:.3f}.")

# Напишіть програму, яка отримує три цифри і друкує їх суму. Кожна цифра виводиться на окремому рядку.
# number_1 = int(input("Enter number 1: "))
# number_2 = int(input("Enter number 2: "))
# number_3 = int(input("Enter number 3: "))
# c = number_1 + number_2 + number_3
# for i in str(c):
#     print(i)

# n студентів беруть k яблук і розподіляють між собою порівну. Решта фруктів залишається в кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в  кошику? Програма зчитує числа n і k і друкує на екрані дві відповіді на поставлені вище запитання.
# n = int(input("Введіть кількість студентів: "))
# k = int(input("Введіть кількість яблук: "))
# k_n = k // n # кількість яблук на одного студента
# r = k % n # кількість яблук, що залишилася нерозподіленою
# print(f"Кожен студент отримає по {k_n} яблук. В кошику залишить {r} яблук")