# print("QWEVXFSD".lower())
# Напишіть програму, яка приймає від користувача рядок, і відображає цей рядок у верхньому і нижньому регістрах.
# Скласти програму, яка запитує назву баскетбольної команди і повторює її на екрані зі словами: This is a champion!.
# Дано натуральне число. Знайти число, що отримується при прочитанні його цифр справа наліво.
# Дано рядок. Змініть регістр символів в цьому рядку так, щоб перша буква кожного слова була великою, а інші літери - малими. (метод s.title())
# Дано рядок. Визначити порядковий номер першої вказаної букви. Якщо такої літе

# Напишіть програму, яка по введеному числу n від 1 до 9 виводить на екран n пінгвінів з відповідним номером - число від 1 до n. Зображення одного пінгвіна має розмір 5 x 9 символів, між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна. Для спрощення малювання скопіюйте пінгвіна із вихідних даних. Врахуйте, що виведення на екран виконується порядково, а не «попінгвінно».

# n = int(input())
# print(f'''
#     _~_    
#    (o o)   
#   /  V  \  
#  /(  1  )\ 
#    ^^ ^^   
# ''', end='')

# # варіант 1
# n = int(input("Введіть кількість пінгвінів: "))
# p1 = "   _~_    "
# p2 = "  (o o)   "
# p3 = " /  V  \\  "
# p5 = "  ^^ ^^   "
# p4 = " ".join([f"/(  {i}  )\\" for i in range(1, n + 1)]) # Формуємо четвертий рядок без циклу
# print(p1 * n)
# print(p2 * n)
# print(p3 * n)
# print(p4)
# print(p5 * n)

# # варіант 2
# n = int(input())
# p1 = "   _~_    "
# p2 = "  (o o)   "
# p3 = " /  V  \\  "
# p5 = "  ^^ ^^   "
# nums = "1 2 3 4 5 6 7 8"[:2 * n]
# p4 = "/(  " + "  )\\ /(  ".join(nums.split()) + "  )\\"\
# # p4 = " /(  "+ str(n) +r"  )\ "
# print(p1 * n)
# print(p2 * n)
# print(p3 * n)
# print(p4)
# print(p5 * n)
# ----------------------------------------------------------------------------------------------------------------------------------
# репетиція
# text = "beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves"
# print(text.capitalize())
# print(text.count("e"))
# print(text.find("a"))
# print(text.index("a"))
# print(text.lower())
# print(text.replace("a","A"))
# print(text.split())
# print(text.startswith("b"))
# print(text.title())
# print(text.upper())
# print(len(text))

# ----------------------------------------------------------------------------------------------------------------------------------

# У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.
   
# text = input('Enter text: ')
# if len(text) > 255:
#     print(False)
# else:
#     print(" ".join(text.split()))

# ----------------------------------------------------------------------------------------------------------------------------------

# Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.
# ex = input("Enter ex: \n") # 5 - 3 +1

# len_ex = len(ex) # 5
# n = (len (ex) + 1) // 2 # кількість цифр
# 1 var -------------------------------------------------------------------------------------------------
# print(int(ex[0]) + (1 if ex[1] == "+" else -1) * int(ex[2]) + (1 if ex[3] == "+" else -1) * int(ex[4]))
# 2 var -------------------------------------------------------------------------------------------------
# sum = int(ex[0])
# for i in range (1, len(ex)):
#     sum += (1 if ex[i+1] == "+" else -1)* int(ex[i+])
# print(sum)
# 3 var -------------------------------------------------------------------------------------------------
# sum = int(ex[0])
# for i in range(1, len(ex)):
#     if ex[i] == "+":
#         sum += int(ex[i+1])
#     elif ex[i] == "-":
#         sum -= int(ex[i+1])
# print(sum)        
# 4 var -------------------------------------------------------------------------------------------------
# ex = ex.replace("-","+-")
# parts = ex.split("+")
# #map()
# sum_ex = sum(map(int, parts))
# print(sum_ex)
# #--------------------------- приклад
# my_list = ["1", "2", 4, 7]
# # for el in range(len(my_list)):
# #     my_list[el] = str(my_list[el])
# # print(my_list)
# new_list = list(map(int, my_list))
# print(new_list)
#---------------------------


# Вхідні дані:
# 5-3+1
# 6+3-2
# Вихідні дані:
# 3
# 7



# Напишіть програму, на вхід якої даються чотири числа a, b, c і d, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка [a; b] на всі числа відрізка [c; d]. Числа a, b, c і d є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтесь формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте \t - символ табуляції. Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.
# Вхідні дані:
# 1
# 4
# 2
# 5
# Вихідні дані:
# 	2	3	4	5
# 1	2	3	4	5
# 2	4	6	8	10
# 3	6	9	12	15
# 4	8	12	16	20
# a = int(input("Enter number a: "))
# b = int(input("Enter number b: "))
# c = int(input("Enter number c: "))
# d = int(input("Enter number d: "))

# if  a <= b and  c <= d:
#     print("---"'\t', end='')
#     for j in range(c,d+1):
#          print(j, end='\t')
#     print()

#     for i in range(a,b+1):
#           print(i, end='\t')
#           for j in range(c,d+1):
#              print((i * j), end='\t')
#           print()
# else:
#     print("Помилка! Дані мають бути в діапазоні  a ≤ b, c ≤ d. Введіть нові дані")

# Напишіть програму для друку літери A за допомогою введеного користувачем символа.
#  Вхідні дані: 
#  * 
#  Вихідні дані: 
#    *** 
#   *   * 
#   *   * 
#   ***** 
#   *   * 
#   *   * 
#   *   * 
# Var 1 
# for i in range(1):
#     print("  ", '*'*3, "  ")
#     for i in range(2):
#         print("  *   *  ")
#     for i in range(1):
#         print("  *****  ")
#     for i in range(3):
#         print("  *   *  ")    
# Var 2 
# print(" *** ")
# print("*   *")
# print("*   *")
# print("*****")
# print("*   *")
# print("*   *")
# print("*   *")


# Напишіть програму, яка визначає, чи є у введеному рядку десяткові цифри, і виводить найбільше число, яке можна скласти з цих цифр. Провідних нулів у числі бути не повинно (за винятком числа 0, запис якого містить рівно одну цифру). Гарантовано, що у рядку є принаймні одна цифра. Вхідний рядок містить довільні символи. Програма повинна вивести найбільше число, яке можна скласти з присутніх в рядку десяткових цифр.
# Вхідні дані:
# Release Date: July 27, 2008
# Last Updated: February 22, 2018
# Вихідні дані:
# 872200
# 822210
#-------------------------------------
# text = input("Введи інформацію: ")
# result = [] #робило список
# for sim in text:
#     if sim.isdigit():   # перевіряє, чи символ — цифра 0–9 та відсортовуємо лише цифри
#         result.append(int(sim)) #повертає у result
# join_a = "".join(map(str, result)) #збираємо назад в рядок та переводимо в число
# print(join_a)
# number = "".join(reversed(join_a)) #перебираємо рядок в зроротньому напрямі
# print(int(number)) #переводимо в число та друкуємо 

