# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
# n1 = int(input ("Enten number_1: "))
# n2 = int(input ("Enten number_2: "))
# print("Сума чисел =" + str(n1 + n2))
# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
# k1 = float(input ("Katet1: "))
# k2 = float(input ("Katet2: "))
# g = ((k1**2 + k2**2)**(1/2))
# print("Гіпотенуза:" + str(g))
# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
# a = input ("Enten number: ")
# c = a * 2
# print("Двічі:",c)
# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.
# a = input ("Напишіть своє ім'я: ")
# print ("Привіт,",a,"!")
# Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.
# name = input ("Напишіть своє ім'я: ")
# print("Прощавай,",name,"!")
# Вік через рік: Напишіть програму, яка запитує ім'я користувача та його вік. Потім виведіть повідомлення, яке повідомляє, скільки йому буде років через рік.
# name = input ("Напишіть своє ім'я: ")
# age = int(input ("Напишіть свій: "))
# print("Привіт," + str(name) + "!","Вітає! Через рік Вам буде " + str((age)+1) + "!") 
# Площа прямокутника: Напишіть програму, яка запитує довжину та ширину прямокутника, а потім обчислює та виводить його площу.
# a = float(input("Введіть довжину прямокутника: "))
# b = float(input("Введіть ширину прямокутника: "))
# p = a*b
# print("Площа прямокутника складає",p)
# Конвертер валют: Запропонуйте користувачеві ввести суму в одній валюті (наприклад, доларах), а потім виведіть цю суму в іншій валюті (наприклад, євро), використовуючи заздалегідь визначений коефіцієнт обміну.
# summa = float(input("Введіть суму в доларах для розрахунку в євро: "))
# k = 1.2 
# print("Сума складє", summa*k, 'євро')
# Вартість покупки: Запитайте користувача назву товару, його ціну та кількість. Обчисліть загальну вартість покупки та виведіть її на екран.
# name_produkt_1 = input("Введіть наазу продукту: ")
# quantity_produkt_1 = float(input("Введіть кількість купленого продукту: "))
# price_produkt_1 = float(input("Введіть ціну продукту: "))
# name_produkt_2 = input("Введіть наазу продукту: ")
# quantity_produkt_2 = float(input("Введіть кількість купленого продукту: "))
# price_produkt_2 = float(input("Введіть ціну продукту: "))
# purchase_price = price_produkt_1 * quantity_produkt_1 + price_produkt_2 * quantity_produkt_2
# print("Загальна вартість порупки складає:", purchase_price, "грн.")
# Температура: Напишіть програму, яка перетворює температуру з градусів Цельсія на Фаренгейт. Запитайте користувача температуру в градусах Цельсія.
# temperatura_сel = float(input("Введіть температуру в градусах Цельсія: "))
# temperatura_f = (temperatura_сel * 9 / 5) + 32
# print("Теспература у Фаренгейтах складає", temperatura_f)