# 1 Створіть список на основі введеної послідовності цілих чисел і надрукуйте другу половину списку. Якщо кількість не парна, то вивести більшу кількість.
# value = "4 6 76 43 5 3 4 7 899"
# print(value)
# value_1ist = list(map(int,value.split(" ")))
# print(value_1ist[len(value_1ist)//2:])
# # n = len(value_1ist)
# print(n)
# m = value_1ist[n//2:]
# print(m)
# p = value_1ist[:n//2]
# print(p)

#---------------------------------------------------------------------------------

# 2 Створіть список на основі введеної послідовності цілих чисел і надрукуйте його елементи таким чином: два останні елементи переміщені з кінця в початок списку без зміни їх початкового порядку.

# value = "4 6 76 43 5 3 4 7 899"
# value_1ist = list(map(int,value.split(" ")))
# print(value_1ist)
# m = value_1ist[:-2]
# r = value_1ist[-2:]
# print(r + m)

#---------------------------------------------------------------------------------

# 3 Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку. Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку. Відсортуйте список в алфавітному порядку і виведіть його елементи в рядку через пропуск.

land = "England Ukraine Deutschland Spanisch Italie"
land_list = land.split(" ") #створили список
# print(land_list)
# land_list_1 = land_list.copy() #зробили копію
# land_list.sort() # відсортували перший список
# print(land_list)

#---------------------------------------------------------------------------------

# 4. Виведіть елементи даного списку в зворотному порядку, не змінюючи сам список.
# land_list_2 = land_list_1[::-1] # зругий список вивели задом на перед
# print(land_list_2)

#---------------------------------------------------------------------------------

# 5. Виведіть всі елементи списку з парними індексами. Вводиться список чисел. Всі числа списку знаходяться на одному рядку.
# for i in range(0, len(land_list), 2):
#     print(i, end=" ")

# ind_land = ", ".join(str(i) for i in range(len(land_list)))
# print(ind_land)
# ind_2 = ind_land[::2]
# print(ind_2)
