# Домашнє завдання:

# Задача 1. Середнє трьох чисел
# Користувач вводить три числа. Обчисли середнє арифметичне.
# nummer_1 = float(input ("Введіть число 1: "))
# nummer_2 = float(input ("Введіть число 2: "))
# nummer_3 = float(input ("Введіть число 3: "))
# aver = (nummer_1 + nummer_2 + nummer_3) / 3
# print ("Середнє значення введених чисел складає:", aver)

# Задача 2. Остача від ділення
# Користувач вводить два числа. Знайди остачу від ділення першого на друге.
# a = float(input("Введіть число 1: "))
# b = float(input("Введіть число 2: "))
# c = a % b
# print("Oстача від ділення першого числа на друге складає", c)

# Задача 3. Подвоєне число
# Користувач вводить число. Виведи подвоєне значення цього числа.
# a = (input("Введіть число 1: "))
# b = float(a)
# print(a * 2, "або", b * 2) # я не зрозуміла про яке подвоєння йле мова: двічі сає написатися одне й те саме число, чи має бути множення на 2

# Задача 4. Конвертація хвилин у секунди
# m = float(input("Введіть кількість хвилин: "))
# c = m * 60
# print("Це складає в секундах", c)

# # Користувач вводить кількість хвилин. Обчисли, скільки це буде секунд.
# m = float(input("Введіть кількість хвилин: "))
# c = m * 60
# print("Це складає в секундах", c)

# Задача 5. Кількість яблук на кожного
# # Є n яблук і k учнів. Скільки яблук отримає кожен учень, якщо ділити порівну, і скільки залишиться?
# apple = float(input("Введіть число яблук: "))
# student = float(input("Введіть число учнів: "))
# ap_st = int(apple // student)
# rest = int(apple % student)
# print("По", ap_st, "яблук отримає кожен учень. Залишок становить", rest, "яблук")

# Задача 6. Остання цифра числа
# Користувач вводить число. Виведи його останню цифру.
# a = input("Введіть число: ")
# print("Остання цифра числа:", a[-1])
# Варіант, що розібрали на уроці
# a = int(input("Введіть число: "))
# print("Остання цифра числа:", a % 10)

# ; Задача 7*. Обмін змінних
# ; Користувач вводить два числа. Після цього потрібно “поміняти” їх місцями і вивести результат.
# nummer_1 = float(input ("Введіть число 1: "))
# nummer_2 = float(input ("Введіть число 2: "))
# list_1 = [nummer_1, nummer_2]
# list_1.reverse()
# print(list_1)
# Варіант, що розібрали на уроці
# n1 = int(input("Введіть число 1: "))
# n2 = int(input("Введіть число 2: "))
# n1,n2 = n2,n1
# print(n1,n2)
# print(n2,n1)